Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.SetIntermediateColors(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Set intermediate color entries (other than the minimum and maximum settings).
map:
Array of intermediate color entries.
Throws Autodesk.Revit.Exceptions.ArgumentException:
intermediate color entries with specific values are not ordered by value (min to max) or too many intermediate colors (>100).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.AreIntermediateColorsValid(System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry})
Verify intermediate color entries
map:
Array of intermediate color entries.
Returns:
True if intermediate colors are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MinColor
Color assigned to the minimum value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MaxColor
Color assigned to the maximum value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings)
Constructs a new copy of the input AnalysisDisplayColorSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011